benchmarks/casesOF/3D/stationaryBubble/quadrant/constant/transportProperties.HF37
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 0.008164965809277261; //0.025819888974716113; //0.08164965809277261;
    rho             rho [1 -3 0 0 0 0 0] 1;
}

phase2
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 0.008164965809277261; //0.025819888974716113; //0.08164965809277261;
    rho             rho [1 -3 0 0 0 0 0] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 1;

curvatureModel heightfunction;
nMax 3;
// ************************************************************************* //
