benchmarks/casesOF/3D/stationaryBubble/quadrant/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//- Number of cells along x direction
nx 32;

//- Number of cells along y direction = nx

//- Number of cells along z direction
nz 1;

//- Position of cell faces in z empty-direction
zposm 0;
zposp #calc  "1.0/$nx";

vertices        
(
    (0 0 $zposm)
    (1 0 $zposm)
    (1 1 $zposm)
    (0 1 $zposm)
    (0 0 $zposp)
    (1 0 $zposp)
    (1 1 $zposp)
    (0 1 $zposp)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($nx $nx $nz) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    xMin
    {
      type symmetry;
      //type            cyclic;
      // neighbourPatch  xMax;
      faces
        (
          (0 4 7 3)
        );
    }
    xMax
    {
      type symmetry;
      //type            cyclic;
      //neighbourPatch  xMin;
        faces
        (
          (2 6 5 1)
        );
    }
    yMin
    {
      type symmetry;
      //type            cyclic;
      //neighbourPatch  yMax;
        faces
        (
          (1 5 4 0)
        );
    }
    yMax
    {
      type symmetry;
      //type            cyclic;
      //neighbourPatch  yMin;
        faces
        (
          (3 7 6 2)
        );
    }
    zMin
    {
        type empty;
        faces
        (
          (0 3 2 1)
        );
    }
    zMax
    {
        type empty;
        faces
        (
          (4 5 6 7)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
